# Olympics

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# read the file
df = pd.read_csv("data/olympics.csv", index_col=0, skiprows=1)
df.head()

,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

Renaming the columns as Gold, Silver and Bronze

In [3]:
for col in df.columns:
    if col[:2] == '01':
        df.rename(columns = {col:'Gold'+col[4:]}, inplace=True)
    if col[:2] == '02':
        df.rename(columns = {col:'Silver'+col[4:]}, inplace=True)
    if col[:2] == '03':
        df.rename(columns = {col:'Bronze'+col[4:]}, inplace=True)
    if col[:1] == '№':
        df.rename(columns = {col:'#'+col[1:]}, inplace=True)

df.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [4]:
df.tail()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Independent Olympic Participants (IOP) [IOP],1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
Zambia (ZAM) [ZAM],12,0,1,1,2,0,0,0,0,0,12,0,1,1,2
Zimbabwe (ZIM) [ZIM],12,3,4,1,8,1,0,0,0,0,13,3,4,1,8
Mixed team (ZZX) [ZZX],3,8,5,4,17,0,0,0,0,0,3,8,5,4,17
Totals,27,4809,4775,5130,14714,22,959,958,948,2865,49,5768,5733,6078,17579

In [5]:
df.index

Index(['Afghanistan (AFG)', 'Algeria (ALG)', 'Argentina (ARG)',
       'Armenia (ARM)', 'Australasia (ANZ) [ANZ]', 'Australia (AUS) [AUS] [Z]',
       'Austria (AUT)', 'Azerbaijan (AZE)', 'Bahamas (BAH)', 'Bahrain (BRN)',
       ...
       'Uzbekistan (UZB)', 'Venezuela (VEN)', 'Vietnam (VIE)',
       'Virgin Islands (ISV)', 'Yugoslavia (YUG) [YUG]',
       'Independent Olympic Participants (IOP) [IOP]', 'Zambia (ZAM) [ZAM]',
       'Zimbabwe (ZIM) [ZIM]', 'Mixed team (ZZX) [ZZX]', 'Totals'],
      dtype='object', length=147)

In [6]:
# split the index by '('
names_ids = df.index.str.split('\s\(') 

df.index = names_ids.str[0] # the [0] element is the country name (new index)
df['ID'] = names_ids.str[1].str[:3] # the [1] element is the abbreviation or ID (take the first 3 characters from that)
df.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,ID
Afghanistan,13,0,0,2,2,0,0,0,0,0,13,0,0,2,2,AFG
Algeria,12,5,2,8,15,3,0,0,0,0,15,5,2,8,15,ALG
Argentina,23,18,24,28,70,18,0,0,0,0,41,18,24,28,70,ARG
Armenia,5,1,2,9,12,6,0,0,0,0,11,1,2,9,12,ARM
Australasia,2,3,4,5,12,0,0,0,0,0,2,3,4,5,12,ANZ

In [7]:
df.tail()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,ID
Independent Olympic Participants,1,0,1,2,3,0,0,0,0,0,1,0,1,2,3,IOP
Zambia,12,0,1,1,2,0,0,0,0,0,12,0,1,1,2,ZAM
Zimbabwe,12,3,4,1,8,1,0,0,0,0,13,3,4,1,8,ZIM
Mixed team,3,8,5,4,17,0,0,0,0,0,3,8,5,4,17,ZZX
Totals,27,4809,4775,5130,14714,22,959,958,948,2865,49,5768,5733,6078,17579,NaN

In [8]:
# if you see in the index, the last row is 'Totals'.
df = df.drop('Totals')
df.tail()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,ID
Yugoslavia,16,26,29,28,83,14,0,3,1,4,30,26,32,29,87,YUG
Independent Olympic Participants,1,0,1,2,3,0,0,0,0,0,1,0,1,2,3,IOP
Zambia,12,0,1,1,2,0,0,0,0,0,12,0,1,1,2,ZAM
Zimbabwe,12,3,4,1,8,1,0,0,0,0,13,3,4,1,8,ZIM
Mixed team,3,8,5,4,17,0,0,0,0,0,3,8,5,4,17,ZZX

### Finding the country by index

In [9]:
def country_by_index(df, country_index=0):
    ''' This function returns the row by given index. By default it is the first.'''
    return(df.index[country_index])

def details_country_by_index(df, country_index=0):
    return(df.iloc[country_index])

In [10]:
print(country_by_index(df, 0))

Afghanistan

In [11]:
print(country_by_index(df, 10))

Barbados

In [12]:
print(country_by_index(df, 100))

Portugal

In [13]:
print(details_country_by_index(df, 0))

# Summer           13
Gold                0
Silver              0
Bronze              2
Total               2
# Winter            0
Gold.1              0
Silver.1            0
Bronze.1            0
Total.1             0
# Games            13
Gold.2              0
Silver.2            0
Bronze.2            2
Combined total      2
ID                AFG
Name: Afghanistan, dtype: object

### Finding the country with most medals (Gold or Silver or Bronze)

In [14]:
def medals(df, medal):
    country = df[medal].idxmax()
    return country

In [15]:
print(medals(df, 'Gold')) # Summer

United States

In [16]:
print(medals(df, 'Gold.1')) # Winter

Norway

In [17]:
print(medals(df, 'Silver'))

United States

In [18]:
print(medals(df, 'Silver.1'))

Norway

In [19]:
print(medals(df, 'Bronze'))

United States

In [20]:
print(medals(df, 'Bronze.1'))

Norway

In [21]:
print(medals(df, 'Total'))

United States

In [22]:
print(medals(df, 'Total.1'))

Norway

In [23]:
print(medals(df, 'Combined total'))

United States

### Finding the country with the biggest difference between summer and winder olympic medal counts

In [24]:
def medal_difference(df, medal = 'Gold'):
    df11 = df.copy() # making a copy of the dataframe
    summer = medal
    winter = medal + '.1'
    
    # Calsulate the difference between summer and winter olympic medals
    # and take absolute value by .abs() function
    df11['diff'] = (df11[summer] - df11[winter]).abs()
    
    # find the country with the biggest difference
    country = df11['diff'].idxmax()
    
    return df11.loc[[country], ['diff']]

In [25]:
medal_difference(df, 'Gold')

               diff
United States   880

In [26]:
medal_difference(df, 'Silver')

               diff
United States   655

In [27]:
medal_difference(df, 'Bronze')

               diff
United States   582

In [28]:
medal_difference(df, 'Total')

               diff
United States  2117

### Finding the country that has biggest difference between their summer gold medal counts and winter gold medal counts relative to their total gold medal counts

(Summer Gold - Winter Gold)/Total Gold

We will include only the countries that have won at least 1 gold in both summer and winter.

In [29]:
def biggest_relative_difference(df, medal="Gold"):
    df11 = df.copy()
    
    # Take the rows with at least one gold medal in both games
    df11 = df11[(df11[medal] > 0) & df11[medal+".1"] > 0]
    
    # calculate total gold medals
    df11['total_'+medal] = df11[medal] + df11[medal+".1"]
    
    # calculate the difference
    df11["diff_"+medal] = (df11[medal] - df[medal+".1"]).abs()
    
    # calculate relative difference
    df11["relative_diff"] = df11["diff_"+medal] / df11["total_"+medal]
    
    # Find the country with the biggest relative difference
    country = df11['relative_diff'].idxmax()
    
    return df11.loc[[country], ['diff','relative_diff']]

In [30]:
biggest_relative_difference(df, "Gold")

/Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages/pandas/core/indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

          diff  relative_diff
Bulgaria   NaN       0.961538

In [31]:
df.loc[['Bulgaria']]

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,ID
Bulgaria,19,51,85,78,214,19,1,2,3,6,38,52,87,81,220,BUL

In [32]:
biggest_relative_difference(df, "Silver")

         diff  relative_diff
Denmark   NaN       0.971014

In [33]:
biggest_relative_difference(df, "Bronze")

         diff  relative_diff
Romania   NaN       0.983333

### Points for medals

Let's write a function that creates a Series called "Points" which is weighted value where each gold medal (Gold.2) counts for 3 points, silver medals (Silver.2) for 2 points, and bronze medals (Bronze.2) for 1 point.

In [34]:
def points(df):
    df11 = df.copy()
    df11["Points"] = (df11['Gold.2']*3) + (df11['Silver.2']*2) + (df11['Bronze.2']*1)
    return df11.iloc[:, -1]

In [35]:
points(df)

Afghanistan                           2
Algeria                              27
Argentina                           130
Armenia                              16
Australasia                          22
                                   ...
Yugoslavia                          171
Independent Olympic Participants      4
Zambia                                3
Zimbabwe                             18
Mixed team                           38
Name: Points, Length: 146, dtype: int64